Merge pull request #258 from manuranga/move-icp-to-manage
Move ICP docs from reference/icp to manage/icp
